In [25]:
import pandas as pd
import json
from io import StringIO
file = {'prasnna':'dindi'}
file_json = json.dumps(file)
pd.read_json(StringIO(file_json),typ='dataframe')

prasnna    dindi
dtype: object

In [10]:
import pandas as pd
import json

# JSON string
file = '{"prasanna": "dindi","chetan":"kammar"}'

# Convert JSON object to a DataFrame
df = pd.DataFrame([json.loads(file)])

print(df)

  prasanna  chetan
0    dindi  kammar

In [29]:
%pip install lxml

Collecting lxml
  Using cached lxml-5.3.0-cp311-cp311-win_amd64.whl.metadata (3.9 kB)
Using cached lxml-5.3.0-cp311-cp311-win_amd64.whl (3.8 MB)
Installing collected packages: lxml
Successfully installed lxml-5.3.0

In [31]:
%pip install beautifulsoup4

Collecting beautifulsoup4
  Downloading beautifulsoup4-4.12.3-py3-none-any.whl.metadata (3.8 kB)
Collecting soupsieve>1.2 (from beautifulsoup4)
  Downloading soupsieve-2.6-py3-none-any.whl.metadata (4.6 kB)
Downloading beautifulsoup4-4.12.3-py3-none-any.whl (147 kB)
Downloading soupsieve-2.6-py3-none-any.whl (36 kB)
Installing collected packages: soupsieve, beautifulsoup4
Successfully installed beautifulsoup4-4.12.3 soupsieve-2.6
Note: you may need to restart the kernel to use updated packages.

In [30]:
%pip install html5lib

Collecting html5lib
  Using cached html5lib-1.1-py2.py3-none-any.whl.metadata (16 kB)
Requirement already satisfied: six>=1.9 in c:\users\prasanna dindi\appdata\local\programs\python\python311\lib\site-packages (from html5lib) (1.16.0)
Collecting webencodings (from html5lib)
  Using cached webencodings-0.5.1-py2.py3-none-any.whl.metadata (2.1 kB)
Using cached html5lib-1.1-py2.py3-none-any.whl (112 kB)
Using cached webencodings-0.5.1-py2.py3-none-any.whl (11 kB)
Installing collected packages: webencodings, html5lib
Successfully installed html5lib-1.1 webencodings-0.5.1

In [45]:
url = "https://www.fdic.gov/bank-failures/failed-bank-list"
data = pd.read_html(url)
print(data)
data[0]

[                               Bank Name               City          State  \
0     The First National Bank of Lindsay            Lindsay       Oklahoma
1  Republic First Bank dba Republic Bank       Philadelphia   Pennsylvania
2                          Citizens Bank           Sac City           Iowa
3               Heartland Tri-State Bank            Elkhart         Kansas
4                    First Republic Bank      San Francisco     California
5                         Signature Bank           New York       New York
6                    Silicon Valley Bank        Santa Clara     California
7                      Almena State Bank             Almena         Kansas
8             First City Bank of Florida  Fort Walton Beach        Florida
9                   The First State Bank      Barboursville  West Virginia

    Cert                 Aquiring Institution      Closing Date  \
0   4134   First Bank & Trust Co., Duncan, OK  October 18, 2024
1  27332    Fulton Bank, National Association    April 26, 2024
2   8758            Iowa Trust & Savings Bank  November 3, 2023
3  25851               Dream First Bank, N.A.     July 28, 2023
4  59017            JPMorgan Chase Bank, N.A.       May 1, 2023
5  57053                  Flagstar Bank, N.A.    March 12, 2023
6  24735  First Citizens Bank & Trust Company    March 10, 2023
7  15426                          Equity Bank  October 23, 2020
8  16748            United Fidelity Bank, fsb  October 16, 2020
9  14361                       MVB Bank, Inc.     April 3, 2020

   Fund  Sort ascending
0                 10547
1                 10546
2                 10545
3                 10544
4                 10543
5                 10540
6                 10539
7                 10538
8                 10537
9                 10536  ]

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
1,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
2,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
3,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
4,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
5,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
6,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
7,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
8,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
9,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536

In [4]:
import pandas as pd
df2 = pd.read_excel(r'C:\Users\Prasanna dindi\OneDrive\Desktop\udemy course\prasanna.xlsx')
df2

      name  address
0  prasanna   dindi

In [3]:
%pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

In [6]:
df2.to_pickle('pickel')

In [7]:
data = pd.read_pickle('pickel')

In [8]:
data

      name  address
0  prasanna   dindi

## Read webscrapping